spec/vcr/Charge/should_create_a_charge_given_details.yml

---
http_interactions:
- request:
    method: post
    uri: https://<key>:@test-api.pin.net.au/1/charges
    body:
      encoding: UTF-8
      string: email=dNitza%40gmail.com&description=A%20new%20charge%20from%20testing%20Pin%20gem&amount=400&currency=AUD&ip_address=127.0.0.1&customer_token=cus_sRtAD2Am-goZoLg1K-HVpA
    headers: {}
  response:
    status:
      code: 201
      message: Created
    headers:
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Fri, 05 Jul 2013 11:20:16 GMT
      Etag:
      - '"0e8ae756b7c2ebfcf71da356c67a3b68"'
      Server:
      - Apache/2.2.20 (Ubuntu)
      Status:
      - '201'
      Strict-Transport-Security:
      - max-age=31536000
      Vary:
      - User-Agent
      X-Powered-By:
      - Phusion Passenger (mod_rails/mod_rack) 3.0.11
      X-Rack-Cache:
      - invalidate, pass
      X-Request-Id:
      - d602ce2eda8caa65fe510bbbfdc3e3e6
      X-Runtime:
      - '0.123908'
      X-Ua-Compatible:
      - IE=Edge,chrome=1
      Content-Length:
      - '645'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"response":{"token":"ch_d_eSZ8bozySJ82DY9HzIgA","success":true,"amount":400,"currency":"AUD","description":"A
        new charge from testing Pin gem","email":"dNitza@gmail.com","ip_address":"127.0.0.1","created_at":"2013-07-05T11:20:16Z","status_message":"Success","error_message":null,"card":{"token":"card_FCERyk5G01NXyJOhOFHNJw","display_number":"XXXX-XXXX-XXXX-0000","scheme":"master","address_line1":"123
        fake street","address_line2":null,"address_city":"Melbourne","address_postcode":"1234","address_state":"Vic","address_country":"Australia"},"transfer":[],"amount_refunded":0,"total_fees":42,"merchant_entitlement":358,"refund_pending":false}}'
    http_version: 
  recorded_at: Fri, 05 Jul 2013 11:20:19 GMT
recorded_with: VCR 2.5.0
