spec/vcr/Charge/should_show_a_charge_given_a_search_term.yml

---
http_interactions:
- request:
    method: get
    uri: https://<key>:@test-api.pin.net.au/1/charges/search?end_date=Mar%2025,%202013&query=mid%20Plan%20-%20My%20Focusbook
    body:
      encoding: US-ASCII
      string: ''
    headers: {}
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - must-revalidate, private, max-age=0
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Thu, 04 Jul 2013 19:04:52 GMT
      Etag:
      - '"0d62314375faedecb4c66395ae60b505"'
      Server:
      - Apache/2.2.20 (Ubuntu)
      Status:
      - '200'
      Strict-Transport-Security:
      - max-age=31536000
      Vary:
      - User-Agent
      X-Powered-By:
      - Phusion Passenger (mod_rails/mod_rack) 3.0.11
      X-Rack-Cache:
      - miss
      X-Request-Id:
      - eef087594f55a04a30bae32dc9053a4b
      X-Runtime:
      - '0.108418'
      X-Ua-Compatible:
      - IE=Edge,chrome=1
      Content-Length:
      - '2091'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"response":[{"token":"ch_0kdOMXP7gG0_W_Vh8qAWdA","success":true,"amount":190000,"currency":"AUD","description":"mid
        Plan - My Focusbook","email":"hello@myfocusbook.com.au","ip_address":"24.84.102.169","created_at":"2013-03-23T01:30:30Z","status_message":"An
        unexpected error has occurred","error_message":null,"card":{"token":"card_h5nBfXPhwVJH5W0jqwl-pQ","display_number":"XXXX-XXXX-XXXX-0000","scheme":"master","address_line1":"33
        Lyon Street","address_line2":"","address_city":"Melbourne","address_postcode":"3040","address_state":"Victoria","address_country":"Australia"},"transfer":[],"amount_refunded":0,"total_fees":5730,"merchant_entitlement":184270,"refund_pending":false},{"token":"ch_0-AWghJMsN2OVC0R9XQ7-A","success":true,"amount":190000,"currency":"AUD","description":"mid
        Plan - My Focusbook","email":"daniel@myfocusbook.com.au","ip_address":"127.0.0.1","created_at":"2013-03-23T01:19:11Z","status_message":"An
        unexpected error has occurred","error_message":null,"card":{"token":"card_ZuXvGMFo3_1RqWxSBeXc2g","display_number":"XXXX-XXXX-XXXX-0000","scheme":"master","address_line1":"333
        Lyon Street","address_line2":"","address_city":"Essendon","address_postcode":"3040","address_state":"Victoria","address_country":"Australia"},"transfer":[],"amount_refunded":0,"total_fees":5730,"merchant_entitlement":184270,"refund_pending":false},{"token":"ch_eAyztfEM3_L9zWeCUVONhw","success":true,"amount":128700,"currency":"AUD","description":"mid
        Plan - My Focusbook","email":"daniel@myfocusbook.com.au","ip_address":"127.0.0.1","created_at":"2013-03-03T00:47:08Z","status_message":"Success","error_message":null,"card":{"token":"card_VaeirBlO45hLNYzGE6TSzw","display_number":"XXXX-XXXX-XXXX-0000","scheme":"master","address_line1":"33
        Lyon Street","address_line2":"","address_city":"Essendon","address_postcode":"3040","address_state":"Victoria","address_country":"Australia"},"transfer":[],"amount_refunded":0,"total_fees":3891,"merchant_entitlement":124809,"refund_pending":false}],"count":3,"pagination":{"current":1,"previous":null,"next":null,"per_page":25,"pages":1,"count":3}}'
    http_version: 
  recorded_at: Thu, 04 Jul 2013 19:04:53 GMT
recorded_with: VCR 2.5.0
